Docs/Reference/Content/images/dependencies/net9.0/mmd/alloverit-entityframeworkcore.mmd
flowchart LR
  alloverit-entityframeworkcore["AllOverIt.EntityFrameworkCore"]
  microsoft-entityframeworkcore-relational_9-0-17["Microsoft.EntityFrameworkCore.Relational<br>v9.0.17"]
  microsoft-entityframeworkcore_9-0-17["Microsoft.EntityFrameworkCore<br>v9.0.17"]
  microsoft-extensions-caching-memory_9-0-17["Microsoft.Extensions.Caching.Memory<br>v9.0.17"]
  microsoft-extensions-configuration-abstractions_9-0-17["Microsoft.Extensions.Configuration.Abstractions<br>v9.0.17"]
  microsoft-extensions-logging_9-0-17["Microsoft.Extensions.Logging<br>v9.0.17"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-entityframeworkcore --> microsoft-entityframeworkcore-relational_9-0-17
  microsoft-entityframeworkcore-relational_9-0-17 --> microsoft-entityframeworkcore_9-0-17
  microsoft-entityframeworkcore-relational_9-0-17 --> microsoft-extensions-caching-memory_9-0-17
  microsoft-entityframeworkcore-relational_9-0-17 --> microsoft-extensions-configuration-abstractions_9-0-17
  microsoft-entityframeworkcore-relational_9-0-17 --> microsoft-extensions-logging_9-0-17
  alloverit-entityframeworkcore --> alloverit
  alloverit --> alloverit-assertion
  style microsoft-entityframeworkcore-relational_9-0-17 fill:#ADD8E6,opacity:0.8
  style microsoft-entityframeworkcore_9-0-17 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-caching-memory_9-0-17 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-abstractions_9-0-17 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging_9-0-17 fill:#FFEC96,opacity:0.8
